dic_article = {
    1: 'article/研究背景及意义.html',
    2: 'article/国内外研究现状.html',
    3: 'article/无人机测量优势.html',
    4: 'article/技术路线.html'
}

dic_forum = [
    {
        'id': 1,
        'title': "什么是杆塔倾斜？",
        'question': "什么是杆塔倾斜？",
        'answer': "杆塔倾斜是指电力输电线路中的支撑杆塔在垂直方向上发生偏移或倾斜的现象。\n这可能是由于多种因素引起的，包括地基沉降、风力、土壤条件等。"
    },
    {
        'id': 2,
        'title': "杆塔倾斜可能造成哪些危害？",
        'question': "杆塔倾斜可能造成哪些危害？",
        'answer': "杆塔倾斜可能带来以下危害：\n1. 安全风险：倾斜的杆塔可能无法承受正常的电力荷载，导致杆塔倒塌或导线脱落，引发触电或火灾事故，威胁人身安全。\n2. "
                  "电力中断：倾斜的杆塔可能导致输电线路中断，造成供电中断，影响人们的日常生活和工作。\n3. 经济损失：倾斜的杆塔可能损坏附近的建筑物、道路或农田，给当地居民和企业带来经济损失。"
    },
    {
        'id': 3,
        'title': "如何检测杆塔倾斜问题？",
        'question': "如何检测杆塔倾斜问题？",
        'answer': "检测杆塔倾斜问题通常采取以下方法：\n1. 定期巡检：定期对杆塔进行巡视，观察是否存在倾斜现象。\n2. "
                  "使用测斜仪：测斜仪是一种专门用于测量杆塔倾斜角度的仪器，可以用来定量测量杆塔的倾斜程度。\n3. 高精度测量技术：使用全站仪等高精度测量设备，对杆塔进行三维测量，获取更准确的倾斜数据。"
    }
]

dict_tower = [
    {
        'id': 1,
        'name': "#测试杆塔一",
        'description': "西安-白鹿原-位于西北角的银灰色杆塔"
    },
    {
        'id': 2,
        'name': "#测试杆塔二",
        'description': "西安-白鹿原-位于西北角的白色杆塔"
    },
    {
        'id': 3,
        'name': "#测试杆塔三",
        'description': "西安-宿舍-电力杆塔模型"
    }
]

dict_tiltData = [
    {'towerId': 1,
     'towerUpperE': "34.1766216 109.1832573 756.617",
     'towerUpperS': "34.1766495 109.1832546 756.521",
     'towerUpperW': "34.1766474 109.1832188 756.495",
     'towerUpperN': "34.1766195 109.1832208 756.579",
     'towerBottomE': "34.1765715 109.1833481 704.244",
     'towerBottomS': "34.1766991 109.1833288 704.255",
     'towerBottomW': "34.1766853 109.1831741 703.678",
     'towerBottomN': "34.1765581 109.1831908 703.656",
     'towerTilt':'2.5081190280489664e-05'}
]

if __name__ == '__main__':
    for key, value in dict_tiltData[0].items():
        print(key, "={},".format(key,))
